Documents/ОстаткиСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ОстаткиСчетов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.БанковскиеСчета</xr:Item>
				<xr:Item>InformationRegister.ОстаткиНаСчетах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Счета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Банк</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Банки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Счета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДокументаОтвета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыДокументовПолученияСведенийОСчетах</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Остаток</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/БанковскиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>БанковскиеСчета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОстаткиНаСчетах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ОстаткиНаСчетах</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДокументовПолученияСведенийОСчетах</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ОстаткиСчетов/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр СведенияОСчетах
	Движения.БанковскиеСчета.Записывать = Истина;
	Для Каждого ТекСтрокаСчета Из Счета Цикл
		Движение = Движения.БанковскиеСчета.Добавить();
		Движение.Счет = ТекСтрокаСчета.Счет;
		Движение.Банк = ТекСтрокаСчета.Банк;
	КонецЦикла;

	// регистр ОстаткиНаСчетах
	Движения.ОстаткиНаСчетах.Записывать = Истина;
	Для Каждого ТекСтрокаСчета Из Счета Цикл
		Движение = Движения.ОстаткиНаСчетах.Добавить();
		Движение.Период = Дата;
		Движение.Счет = ТекСтрокаСчета.Счет;
		Движение.Событие = ТекСтрокаСчета.ТипДокументаОтвета;
		Движение.Остаток = ТекСтрокаСчета.Остаток;
	КонецЦикла;

КонецПроцедуры
